app/views/merchants/dashboard.html.erb

SELECT "products".* FROM "products" WHERE "products"."merchant_id" = $1  [["merchant_id", 11]]
---

<% @merchant.products.each do |product| %>