app/views/merchants/show.html.erb

<div class="card-deck container" id="merch-prod-deck">
    <% @merchant.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."merchant_id" = $1  [["merchant_id", 1]]