app/controllers/application_controller.rb

  def find_merchant
    @current_merchant = Merchant.find_by(id: session[:merchant_id])
---
SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]