app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @category = Category.find_by(id: params[:id])

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Nuts"], ["created_at", "2019-05-06 22:25:29.354883"], ["updated_at", "2019-05-06 22:25:29.354883"]]
---
  def create
    category = Category.new(category_params)

    is_successful = category.save