app/controllers/merchants_controller.rb

SELECT "merchants".* FROM "merchants" ORDER BY "merchants"."id" ASC
---
  def index
    @merchants = Merchant.all.order(:id)

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @merchant = Merchant.find_by(id: params[:id])

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."uid" = $1 AND "merchants"."provider" = $2 LIMIT $3  [["uid", 44131483], ["provider", "github"], ["LIMIT", 1]]
---
  def create
    auth_hash = request.env["omniauth.auth"]

    merchant = Merchant.find_by(uid: auth_hash[:uid], provider: "github")

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def dashboard
    @merchant = Merchant.find_by(id: session[:merchant_id])

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def logout
    merchant = Merchant.find_by(id: session[:merchant_id])