app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @order = Order.find_by(id: params[:id])

INSERT INTO "orders" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-05-06 17:08:26.674928"], ["updated_at", "2019-05-06 17:08:26.674928"]]
---
  def create
    order = Order.create

SELECT  "orders".* FROM "orders" WHERE "orders"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def edit
    @order = Order.find_by(id: session[:order_id])

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "orders" SET "name" = $1, "email" = $2, "address" = $3, "cc_num" = $4, "cc_exp" = $5, "cc_cvv" = $6, "billing_zip" = $7, "updated_at" = $8 WHERE "orders"."id" = $9  [["name", "h"], ["email", "h"], ["address", "h"], ["cc_num", 0], ["cc_exp", "h"], ["cc_cvv", 0], ["billing_zip", 0], ["updated_at", "2019-05-06 17:14:27.797581"], ["id", 4]]
---
  def update
    @order = Order.find_by(id: session[:order_id])
    is_successful = @order.update(order_params)