app/controllers/products_controller.rb

  def show
    @product = Product.find_by(id: params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def new
    @product = Product.new

    if params[:merchant_id]
      @product.merchant = Merchant.find_by(id: params[:merchant_id])
---
SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."merchant_id" = $1  [["merchant_id", 6]]

  def create
    product = Product.new(product_params)
    #currently hardcoding merchant to merchant first (delete this once the merchant login is working)
    product.merchant = Merchant.first
---
SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def find_individual_product
    @product = Product.find_by(id: params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]