app/controllers/products_controller.rb

  def create
    product = Product.new(product_params)

    product.merchant = @current_merchant

    is_successful = product.save

    if is_successful
      flash[:success] = "Product added successfully"
      redirect_to product_path(product.id)
    else
      product.errors.messages.each do |field, messages|
---
INSERT INTO "products" ("name", "price", "description", "photo", "inventory", "created_at", "updated_at", "merchant_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "merchants".* FROM "merchants" ORDER BY "merchants"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def update
    is_successful = @product.update(product_params)
---
UPDATE "products" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["name", "MAGIC shirt"], ["description", "cool shirt"], ["updated_at", "2019-05-06 06:45:51.853468"], ["id", 7]]

  def retired
    if @product.nil?
      flash[:error] = "That product does not exist"
    else
      @product.toggle(:retired)
      @product.save
---
UPDATE "products" SET "retired" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["retired", true], ["updated_at", "2019-05-06 17:32:35.391891"], ["id", 10]]

  def find_product
    @product = Product.find_by(id: params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]