app/views/products/_form.html.erb

SELECT "categories".* FROM "categories"
---
<%= f.label :category %>
<%= collection_check_boxes(:product, :category_ids, Category.all, :id, :name) %>