app/views/products/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "categories_products" ON "categories"."id" = "categories_products"."category_id" WHERE "categories_products"."product_id" = $1  [["product_id", 1]]
---
    <li>Categories:
    <% @product.categories.each do |category|%>