app/views/layouts/application.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
            <ul class="dropdown-menu" role="menu">
              <% category = Category.all.order(:name)%>

SELECT "merchants".* FROM "merchants" ORDER BY "merchants"."name" ASC
---
            <ul class="dropdown-menu" role="menu">
              <% c = Merchant.all.order(:name)%>

SELECT  "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
            <li class="nav-item app-header__nav_item">
              <%= link_to "Merchant Dashboard", dashboard_path(id: Merchant.find(session[:merchant_id]).id), class: "btn btn-primary" %>